html/projects/utilization.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-30 Tue 00:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Utilization</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Utilization</h1>
<div id="outline-container-orgd771aab" class="outline-2">
<h2 id="orgd771aab"><span class="section-number-2">1.</span> Academic Projects</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><a href="https://gitlab.com/lorenzohess/dante-site-backend">Commedia Word Counts Website</a>, 2022: search for words in the <i>Divine Comedy</i>, along with their counts and frequencies.</li>
<li><a href="https://gitlab.com/lorenzohess/xml-commedia">XML Commedia</a>, 2022: Dante&rsquo;s <i>Divine Comedy</i> encoded as XML, down to each word.</li>
</ol>
</div>
</div>
<div id="outline-container-orgbf321de" class="outline-2">
<h2 id="orgbf321de"><span class="section-number-2">2.</span> Software</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><a href="https://gitlab.com/lorenzohess/divina-commandline">Divina Commandline</a>, 2022: very basic CLI tools for interacting with the <i>Divine Comedy</i> from the CLI.</li>
</ol>
</div>
</div>
<div id="outline-container-org80ab014" class="outline-2">
<h2 id="org80ab014"><span class="section-number-2">3.</span> Mechanical</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgeb34738" class="outline-3">
<h3 id="orgeb34738"><span class="section-number-3">3.1.</span> 3D Modeling</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li><a href="https://github.com/lorenzohess/pill-gate-kirkland-393914">Pill Gate Gadget</a>, 2025: increases the convenience with which one can retrieve a single Vitamin D pill from Costco&rsquo;s Item <code>393914</code> bottle.</li>
<li><a href="https://gitlab.com/lorenzohess/fruit-fly-liquid-trap">Fruit Fly Liquid Trap</a>, 2024: simple 3D model of a fruit fly trap.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org94b042f" class="outline-2">
<h2 id="org94b042f"><span class="section-number-2">4.</span> Sports</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="https://gitlab.com/lorenzohess/water-polo-crash-course">Water Polo Crash Course</a>, 2024: a crash course in water polo, intended as review for players with some experience.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="email">Email: <a href="mailto:lorenzohess@tutanota.com">lorenzohess@tutanota.com</a></p>
<p class="date">Created: 2025-12-30 Tue 00:13</p>
</div>
</body>
</html>
